["從各先進國家（如美國、英國、法國、芬蘭等）無不對弱勢且學習成就低的學生提出各項輔導與配套措施觀之，各國均認為學生學力及代表國家競爭力（呂虹霖、許秀敏，2012），這個想法與經濟合作暨發展組織（OECD）推動的國際學生評量計畫（PISA），針對各國十五歲學生在閱讀、數學、科學領域的素養能力進行評量，以象徵一個國家的競爭力十分契合。我國教育部自2003年起針對國內一般地區學生規劃「關懷弱勢、弭平落差課業輔導計畫」，至今已經超過16年了，從2006年「攜手計畫-課後輔助方案」到2013年教育部輔助直轄市、縣市政府補救作業要點、2016年各學校開始推動減C計畫、2016年兩班三組數學教學設計等各項補救教學措施，其成效仍受到不少質疑，因此尋求一個有效的補救教學方案一直是各級教育行政與機構所致力的。","從另一個角度來看，知識與概念的建構與發展是由人們的大腦主宰，若將兒童認知發展比擬成生物體身體的發展，則大腦對於知識建構與認知發展就如同身體的生理發展一般，是持續且漫長的。在認知成長過程中，不同的兒童遭遇問題也會有不同，對於知識的吸取方式也各有所異，因此在學習的過程有吸收快慢之別。在身體成長上，多數的家長一旦發現孩子身體健康出了狀況，多數會積極求問醫生尋求治療；倘若一個國家發現國內有三分之一的兒童同時患有特定的健康問題，肯定也會傾國家之力，積極防預或治療。相同的，倘若象徵一個孩童腦內發展的「知識體」出現不足以適應社會需求時，身為教育者的我們也應該積極改善這個現象才是。因此當一個國家發現有三分之一孩童在基礎學科工具的素養或能力呈現積弱，甚至不足以適應生活所需或承接其他學科時，國家又豈能坐視不顧或僅消極地認為無能為力？而這樣的情狀已然發生了。根據這多年國中會考公告的結果，我們的國中畢業生有超過三成的學生數學落於「待加強」，而具備這樣學力的國中生，我們怎能期待他們能繼續應付後續的數學內容？","十二年國民基本教育是近來社會上最熱門的教育議題，但此議題對於實際教學層面或後續衍生配套仍很難引起社會的廣泛重視，諸如如何協助在國中階段未學好工具學科的學生銜接難度急遽躍升的高中職教材？如何協助中小學數學老師面對這類的學生？…等等，這些都是國內教育工作者需要面對的基本問題。108學年上路的數學新課綱，可以預想的我們國家仍將有超過三成的孩童在數學素養或能力呈現積弱現象。因而，面對蓄勢上路的十二年國民基本教育，讓我們的中小生掌握必要的數學基本學習內容以順利銜接後續的學習，已是刻不容緩的工作了，但是在教學資源與制度的限制下，期望每個學生都能達到預定的教學目標幾乎是一個高不可攀的理想，補救教學的任務就更為沈重。","目前教育部的補救教學的思維策略是補救學生「過去不足」，亦即於九月剛開學時對學生進行前一個年級學習範疇的篩選測驗。不可否認的，對於數學學科特性是奠基在之前所學內容，前一階段的學習內容若未充分具備確實會造成後續學習的困難，因此補救前一年的內容看似合情合理的策略，然而在新學習內容不斷湧來，在學生與家長也希望跟上學校進度下的期望下，補救前一年的內容不免讓學生失去學習意願，因此對於學校所設置的免費補救教學課程參與度不高，研究主持人近幾年實地參訪所得到資訊，發現各校補救教學若是教前一年的內容其成效是似乎很難得到校方、教師與學生的認同。多數人都同意，補救教學還是需要以當下的內容為主，當學期內容能立刻獲得補救才能兼顧效果與意願。問題是，這樣的想法是否可能實踐？","當全國有三分之一以上的學生連最低數學學力都沒有的情況下，補救教學已不再是少數學生額外加強的課程，而是一個普遍的教育工作，需要的不是將低成就的學生抽離上課，而是所有學生都能投入平常的數學課程。但是在有教學進度的壓力下，怎麼可能在課堂上進行補救教學？因此在理論與實際的平衡下，「迎頭趕上」的想法不得不納入考量，當中的關鍵就在於，什麼是我們認定的「學習成效」？什麼又能激起學生的熱情參與？在計畫主持人的另一個研究中，發現情意與認知是分不開的（謝佳叡，2011），亦即學生如果聽不懂則不可能有意願參與。這樣的研究也在宋玉如（2008）關於中學數學教師應有的數學教學特質研究中得到驗證，該研究以隨機方式對全國國、高中生共4514人進行問卷調查，研究者提供了幾個常見的數學表徵，包含：例子、圖畫、比喻、生活例子、實際數值、證明、定義、公式、故事、抽象符號等表徵給中學生選擇，詢問從學生觀點來看，理想的中學數學教師在數學教學中應儘量以何種表徵呈現？研究結果揭露，九成以上的中學生都認為理想教師在數學教學中應儘量以例子、圖畫、恰當比喻、生活物品表徵來傳遞數學概念；其次是使用數值實例、證明、定義；而最不符合學生心中理想教師的表徵使用是公式、故事與抽象符號來傳遞數學概念。這個結果顯示出中學生對於數學學習上認為老師應聚焦於「讓學生理解數學」、「避免僅用形式的、抽象的表徵」，有趣的是，教師們認為應多用於引發學生興趣的「故事」表徵，並非學生認為理想的數學概念傳遞表徵，相反的，有超過四成的學生認為故事不是一個很好的數學教學表徵。許多老師感到不解，不是大家都愛聽故事？為什麼他們不喜歡老師用故事來教學。故事的特性不就是譬喻，透過一個敘事情境來指涉背後真正的意涵，數學已經是不容易理解的學科，能說清楚已經不易，如果再用故事包裝學生就更不容易體會。換言之，對於數學學習來說，「聽懂」比「有趣」更受學生青睞。","同一個研究，宋玉如（2008）也發現關於媒體的選用與呈現，中學生認為理想的教師應要適當地使用教具（如，圖卡、模型、生活物品）教學，其次是電腦輔助教學，而只使用粉筆黑板的教師則最不受學生喜愛。這個研究不僅能帶給實際的數學教師許多省思，也提供我國實徵性研究資料，在台灣不同的表徵對於學生的確有不同的教學期望與感受，此也提供本研究對於數學表徵選擇的分析洞察。這個研究至少帶來兩個教育上的意涵，第一，我們的學生在數學學習上有一個卑微的心願：讓他聽的懂。只要能讓他懂的表徵，他都認為是一個好老師應該提供的。其次是，教師使用不同的表徵會讓學生有不同的參與感，而這個調查中也包含那些低成就的學生，同樣希望老師可以提供好的數學表徵讓他們可以參與。這些都給我們提供一個很重要的訊息，或許補救教學是否可以有好的成效，教師選擇的數學表徵形式與學生參與程度與類型有著關鍵性的影響，此也觸發本研究想要從這樣的兩個面向來進行補救教學成效的探究。","在此特別說明本研究使用「教學表徵」與「數學表徵」兩個詞彙的差異。無論是數學概念、方法與思維都是無形的，因此必須透過某種具體、半具體、抽象的物件、符號或語言來加以顯示、表達或紀錄，這些用來表現數學概念、方法與思維的物件、符號或語言，就是「數學表徵」。因此表徵（representation）並非概念本身，而是對於一個被表徵概念的一種再呈現方式（re-presentation），又可分為內在表徵（signified; internal）與外在表徵（signifier; external）（Goldin \u0026 Kaput, 1996; Hiebert \u0026 Carpenter, 1992）。而本研究所謂「教學表徵」聚焦於數學教學表徵，是指教師在數學教學過程上，「對於數學表徵的理解與運用等相關教學知能與展現」，因此教學表徵是以數學表徵為運作對象。經由文獻考察與本研究徵詢專家意見後，選擇教師的數學表徵理解與運用、多元數學表徵認知、數學表徵選擇與表達、表徵轉化與教材設計、學生內在表徵的察覺（noticing）等五樣作為主要探討項目。例如，教師怎麼理解教材中的不同表徵與其功能？（多元數學表徵認知）在準備教材時學習單會使用哪樣的例子？（數學表徵理解與運用、教材設計）教學時會想用什麼形式的教具？當講解數學概念時會選擇使用什麼表徵講解？（數學表徵選擇與表達）在文字題學生聽不懂時或不理解時，老師又會如何轉換表徵講解？（表徵轉化）如何從學生的回答或表達探知 學生的數學想法？（學生內在表徵的察覺）等等。","有關數學表徵在數學學習的角色上，許多研究已經指出表徵對數學學習與解題佔有重要的角色（Goldin \u0026 Kaput, 1996; Kaput, 1991）。關於教學表徵方面，Bruner在發現學習論中，將人類對於其環境中的事物經知覺而將外在物體或事件轉換為內在事件的過程稱為認知表徵（cognitive representation）或知識表徵（representation of knowledge），意指人類是經由認知表徵獲得知識（張春興，1996）。依據Bruner的研究，這樣的認知表徵有三種：動作表徵、圖像表徵、符號表徵（張春興，1996；Resnick \u0026 Ford, 1981）。對於數學教師而言，選擇適合的數學表徵來協助學生內化數學內容對於學生的數學學習扮演關鍵角色，透過教師與教材所提供的數學外在表徵來與學生內在表徵系統關連起來，對於學生建構內在表徵則有其重要性。","不只是認知面向，好的教學表徵也可以從情意面向來影響學生數學學習。謝佳叡（2011）在探究職前教師的教學概念心像研究中，提出教師在教學表徵的選擇與使用的考量導向浮現出五種類型來，分別為（1）概念典型與衍生型表徵；（2）情境導向表徵；（3）教學流程導向表徵；（4）教學功能性導向表徵；（5）學生感知導向表徵等，其中教學流程導向與學生感知導向都涉及學生的情意面向。所謂教學流程導向是指教師的表徵選擇乃依照數學概念（或單元）在課堂上的教學流程，亦即認為對於單元或概念的教學在教學前、中、後時期皆有個別適用的表徵，例如，有教師認為不論什麼單元一個概念引入教學必先使用生活實例引起動機，之後講解再用圖形、表格表徵，最後整理用公式、式子，如此選擇不只表達出表徵與教學的關連，也展現出表徵使用的信念。謝佳叡（2011）進一步指出教師在教學前或剛進入教學，習於用來作為概念引入、銜接或引發學習動機的表徵稱為「前導性表徵」，教師常用的前導性表徵多為故事與生活實例表徵，也會使用圖形表徵作為教學引入，主要的功能是引發學習動機、增加學習興趣，連結既有知識，重點在於引發學生學習動機與鼓勵學生參與。換言之，這個研究發現教師教學表徵的使用與學生參與做了連結，亦即適當表徵的使用不只是讓學生容易理解，也可能目的是為了讓學生將注意力放在老師或教材內容上。若將教學比喻成任務執行，則學生參與應該是第一關卡，即便是最優異的教學內容，若學生不投入參與，如同一場沒有聽眾的頂級音樂會；相對的，如果一個沒有關心學生參與的教學，有怎能算是完善的教學？","一直到了80年代末期，學生參與（Student engagement）才首次形成一個研究上的構念。近年有關「Engagement」這個議題受到國內外學者許多關注，因此Engagement一詞也衍生更多樣的意義與翻譯。在名稱上，Engagement有人譯為「參與」（如謝佳叡，2011、2014；謝豐瑞，2012）有學者稱為「學習投入」（如張鈿富、林松柏、周文菁，2012）。Engagement在類型上有學者又進一步分為學業投入（Academic engagement）、學校投入（School engagement）、學生投入（Student engagement）、…等不同名稱（張鈿富、林松柏、周文菁，2012）。其中，李靜儀與龔心怡（2019）將「學業投入」此一構念定義為學生在課業學習活動與作業完成過程中，投入的專注與熱誠，學習者在投入的過程中會透過發問和參與分組活動學習、理解或精熟知識和技巧。","然而，不同學者對這些名稱都有不同的定義，莫衷一是，區分這些名稱並非本研究的主要目的，因此本研究仍採用計畫主持人常用的名稱，將Engagement稱為「參與」，並以「學生參與」概稱在教師的教學歷程中，學生對活動參與、投入、關注程度。例如，吸引學生興趣、引起動機、內容難易是否適切等，都與學生參與有直接或間接的相關（謝佳叡，2014），因此對於學生參與本身，教師關心學生參與至少有兩個面向。首先是教師期望學生將心思放在數學課堂上，也就是學生是否樂於或外顯行為上的投入教師所規範的課堂活動，亦即其他研究所稱的「情感參與」或「行為參與」；另一面向則是希望學生的思考與數學知識產生交流，亦即其他研究所稱的「認知參與」（或「數學參與」）。參與課堂並不保證參與數學，反之亦然，然而將學生心思吸引到課堂對引動學生數學參與具有關鍵性的影響。由於在補救教學的研究上，許多研究都聚焦在補救教材的內容、評量或診斷方法，或是教學方法與補救教學政策，國內研究將焦點放在教師進行補救教學時所使用的表徵與學生參與方面的實徵性研究並不多，而將對象放在師培生的就更少了。","本計畫主持人多年參與有關數學補救教學的計畫實際接觸從事補救教學的教學者，以及在許多補救教學的研習場合中，發現許多學校被賦予數學補救教學任務的老師，經常是初任教師、實習教師、大學生，或是非數學科的教師授課，甚至也有因為找不到有意願的老師因而親自上陣的行政人員，如此也不禁讓人為補救教學的政策擔憂。而補救教學既是一個不能逃避的教育議題，其涉及對象更加普遍與廣泛，理應被視為一個國家師資培育政策的重要項目，當補救教學的執行經常交由師培生、實習教師、新任教師或非專業人士來執行時，是否也反映出我們對於補救教學任務的態度與信念需要調整，讓補救教學成為師資培育的基礎課程之一，從師資培育課程就開始做起，要求師資生、實習生等也需有這方面的認識，如此才能真正成為未來數學師資全方位的實踐者。在此概念下，我們應該有更多的研究基礎。","本研究計畫提出原規劃三年期實施，並以整合型計畫提出，於去年提出原計畫後，承蒙科技部支持獲得先期（第一年）的補助。本計畫則延續第一年的執行成果，根據第一年到目前為止的執行情況與部分研究成果，並參考第一年計畫審查委員的建議，繼續提出接續的畫第二、三年的規劃，希望能完成更完整的規劃。有關回應第一年審查委員意見修正部分將於本節第（五）部分陳述。經近一年的執行已獲得初步的成果則呈現於研究設計一節。","根據前述，有鑑於新課綱即將上路，其中「素養導向」與科技融入數學課堂是本次的兩大推動主軸，同時作為國內教育政策重要推動項目之一的補救教學，其實踐策略與成效評估也勢必需加以調整以契合新課綱的精神，非墨守既有做法，這也使得探究符應素養導向的數學補救教學策略、實踐與成效評估這樣的導向性應用研究，更顯急切與必要。","數學補救教學實踐與成效涉及層面既廣且多，對於即將進入教育職場的師資生而言更是必須面對的挑戰。其中教師教學策略與學生學習動機是補救教學成效的兩個重要且難以忽略的要素，教學策略需要透過教學表徵加以實踐，而學生學習動機可以透過學生的參與意願來加以檢驗。因此本研究的目的是試圖從教師教學策略中的數學表徵選擇與學生參與程度兩個角度切入，探討中小學數學補救教學中，不同單元的各種數學表徵選擇與教學表徵的使用，對於學生學習參與的意願與程度的影響，進而評估兩者對於補救教學課堂實踐與學習成效的影響。","本研究的目的是試圖從教師教學策略中的數學表徵選擇與學生參與程度兩個角度切入，探討中小學數學補救教學中，不同單元的各種數學表徵選擇與教學表徵的使用，對於學生學習參與的意願與程度的影響，進而評估兩者對於補救教學課堂實踐與學習成效的影響。因此在本節文獻探討與理論架構分成三個部分，分別是表徵與教學表徵、學生參與的文獻探討，本研究理論架構。其中有關教學表徵與學生參與主要是延續本計畫主持人博士論文的研究成果。","數學概念、方法與思維，不管在腦中或是抽象的存在，都是無形的，因此我們在進行數學概念或想法溝通時，必須把它用某種方式或面貌展現出來，而我們也會用這樣的方式來看我們腦中的數學想法或概念，這就是表徵。由於數學知識必須透過某種外顯的表徵將之傳遞出來，因此教學時選用適當的表徵對於教學成效有著決定性的影響，這也是表徵為數學教育學者重視之除。表徵這個概念在二十世紀末期開始引起大量的討論，美國數學教師協會（National Council of Teachers of Mathematics，[NCTM]）甚至在2000年新公布的「學校數學之原則與標準課程與評量標準」中，特別新增「表徵」為數學課程中五大數學活動（process）標準之一（NCTM，2000），可見其重要性，許多研究也顯示教師選用不同的表徵也經常與學生數學學習情意面向的提升有關（謝佳叡，2011）。","Goldin（1998）認為表徵可以是符號、圖像、文字、或任何可以用來代表或呈現某些事物的東西。概念的表徵（representation）並非概念本身，而是對於一個被表徵概念的再呈現（re-presentation）；就像我們會用各種不同的名字、照片、身份證號碼、手機編號、特性描述、親屬關係、暱稱、…等方式來表徵一個人，而這些表徵方式在不同場域也都有不同的功用與傳達效率。換言之，每個表徵對於該概念的表示是否合適是因時因人而定。數學概念亦若是，有時必須用文字定義才能明確界定，有時卻是符號更為簡潔，有時卻是一個圖勝過千言萬語。","許多學者從心理認知層面主張表徵與學習關連。如Bruner在發現學習論中將人類對於其環境中的事物經知覺轉換為內在事件的過程稱為認知表徵（cognitive representation）或知識表徵（representation of knowledge），意指人類是經由認知表徵獲得知識，並將這樣的認知表徵分為動作表徵、圖像表徵、符號表徵（張春興，1996；Resnick \u0026 Ford, 1981）。游自達（1995）從認知心理學的觀點認為表徵在數學學習上是一個十分有力、有彈性的工具，可以有效的進行數學思考、與他人溝通，並建議在學生學習過程中，教師應該注意不同表徵系統間的關聯，並靈活使用各種表徵方式來傳達數學概念。陳霈頡、楊德清（2005）深入探討表徵的意義及其在教學上的功用，認為表徵是認知活動下的產物，發現學生會因為認知思考的改變而選擇使用不同形式的表徵，並認為數學表徵與解題思考是彼此互相影響的，因此，可以藉由選擇的表徵了解認知結構的發展情形。","許多研究也指出表徵對數學學習佔有重要的角色（Goldin \u0026 Kaput, 1996; Kaput, 1991），如Mason（1987）認為符號表徵在數學學習的過程中是不可或缺的工具。Allardice（1977）調查了兒童在數學學習上使用表徵的發展，研究要求3-4歲、4-5歲、5-6歲和6-7歲，四組共81名兒童以書面形式表達幾個數學概念（例如時間、自然數）；給予兒童2到4件物品，要求他們寫下共有多少玩具，大部分5、6歲兒童可以正確使用數字、4歲兒童有時使用數字，但更常使用其他圖形正確的表示。大約一半的3歲兒童做出正確的表示，但通常是圖形而不是數字。Booth與Siegler（2006）則是研究幼稚園到四年級的學生對於自然數估計的表徵發展與個體差異，研究中要求兒童解決四種數字估計的問題（計算、數量、測量以及數線）。例如詢問兒童34+29的結果是接近40、50或是60；根據研究結果歸納出不同年齡層的學生其線性表徵發展趨勢，認為兒童越來越依靠線性的表徵方式並減少單純數字的表達，且所有類型的估算技能都與數學考試成績呈現正相關。","除了有關於表徵對數學學習的成效研究外，有些研究直接將焦點放在學生的數學表徵能力。也就是如Niss與Højgaard (2011)將數學表徵視為學生應具備的數學能力之一個，因此提升學生的表徵能力本身就是一種數學學習成效。由於數學表徵並不隸屬某一個特定的數學內容，因此許多研究對學生數學表徵能力的提升的探究聚焦在不同的教學方法與傳統教學法對提升學生表徵能力的成效比較。Tandililing（2015）運用準實驗研究法檢驗問題導向教學法（Problem based learning，PBL）對於提升九年級中學生數學表徵之成效，研究指出問題導向學習不但可以改善學生的數學表徵能力，也可增進學生熱情地參與活動、增進學生學習的動機。Minarni、Napitupulu和Husein（2016）也做了類似的研究，同要得到類似的結果，認為創新學習方法，例如PBL，可以提高學生的數學理解能力和數學表徵能力。","Fauzan、Musdi和Yani（2017）同樣採用準實驗研究法比較真實數學教育方法（Realistic Mathematics Education，RME）與傳統方法對於學生數學表達能力的影響，該研究結果產生提出兩個發現，首先，在不同層級學校實施RME方法都能有效提升學生的數學表徵能力，認為RME方法是合適的各個層級的教育。其次，RME方法對於男女學生都能提供同樣的機會發展他們的數學表徵能力，且都比傳統的學生表現更好。Supandi、Waluya、Rochmad、Suyitno和Dewi（2018）的研究同樣採用準實驗方法，使用數學表徵能力量表與自我效能量表檢測學生的數學表徵能力和自我效能感程度，研究發現自我效能感高的學生在數學表徵能力的測試都優於中等或較低自我效能感的學生；而中等自我效能感的學生則優於自我效能感較低的學生。更具體地說，該研究表明自我效能感的程度顯著影響學生的數學表徵能力。在國內方面Chen、Lee和Shu（2015）的研究將焦點放在小學生關於模式推理的知識，檢驗數學自我效能感與具有多元表徵形式的數學學習材料上的學習表現，以及學習態度之間的關連，研究成果表明使用圖形表徵的學習材料可以增強模式推理方面的表現。這都給我們的研究有重要的啟發。","在有關表徵的研究中，表徵系統大致可以被分為內在表徵（signified; internal）與外在表徵（signifier; external）兩類（Goldin \u0026 Kaput, 1996; Goldin \u0026 Shteingold, 2001; Hiebert \u0026 Carpenter, 1992），其中，外在表徵是以語言、文字、符號、圖形或物件等作為人與人、人與數學溝通，以及幫助解題的工具；內在表徵是扮演著人們對概念、語言、題意的解讀以及呈現自我內在心像的角色。簡單的說，外在表徵是主要用來表達人們心中的想法，而內在表徵則因為無法直接被觀察，因此需要藉由外在表徵來進行推論或解讀，但兩者是密切連結的（English \u0026 Halford，1995；Greeno，1987；Mason，1987；陳霈頡、楊德清，2005）。也因為所有數學概念都是抽象的，因此必須透過表徵來進行概念教學，因此老師在表徵的選擇與運用上，經常需要和學生認知關連在一起，有研究也顯示職前教師在表徵選擇的心像上確實經常與學生認知有蘊轉關係。（謝佳叡，2011）","而對於教學來說，數學表徵的理解當然是一個重要的數學能力，我們無法想像一個對數學表徵不瞭解的老師，如何能做好教學動作。因此，在Niss與Højgaard (2011)將數學表徵視為八個數學能力向度的其中一個，這個能力包含（1）能理解與運用（解讀、詮釋及辨識）數學物件、現象、情境的各類表徵；（2）能理解和運用相同數學物件之不同表徵之間的關係，包括了解不同表徵的優勢與限制；（3）能在表徵之間進行選擇與轉化。本研究將這三個數學表徵的子能力轉換為教學表徵維度，之重組為教師的四種教學表徵，分別為「數學表徵理解與運用」、「多元數學表徵認知」、「數學表徵選擇與表達」、「表徵轉化與教材設計」，前兩者分別對應到（1）和（2），而後兩者對應到（3），之所以將之又拆成選擇與轉化兩種，因為對於教學而言，這表徵之間進行選擇與轉化應屬兩種不同的功能。","從數學教學來看，數學表徵至少有三種的溝通功能。（一）師生之間的溝通功能：教學表徵就是連結教師與學生之間溝通管道。English與Halford（1995）認為在教與學中，教師藉由表徵作為學生理解數學概念的引導，教師也可以透過學生所使用表徵所傳達出的數學概念來確認學生理解的情形，這個說法典型的將此功能彰顯出來。（二）擔任學生與數學的溝通管道：也就是數學表徵可以扮演著學生對題意的解讀以及內在心像的角色，因此在概念理解或解題時，學生是否可以產生及運用適當的表徵，對於成功解題有著關鍵的地位。（三）人與真實世界的溝通：人們經常透過數學表徵作為世界的探索，無論是數學世界或真實世界。左台益與梁勇能（2001）更直接表示，幾何概念與表徵是數學與真實世界溝通的重要方式之一。由於教師與學生在認知上有所不同，因此表徵使用與表徵的選擇就會有差別。舉例來說，老師想要傳達一個圓錐的概念，他拿出一個甜筒作為模型來表達心中圓錐的圖像，當老師拿著這個模型時，內心想的是一個圓錐模型，然而學生看到的是甜筒的實物，而非是一個圓錐的結構，因此當老師在解釋圓錐相關的性質時，學生的認知並沒有相對應的內在表徵，造成彼此傳遞上的落差。由此可知，對於數學教師而言，選擇適合的表徵來協助學生內化數學內容對於學生的數學學習扮演關鍵角色，透過教師所提供的數學外在表徵來與學生內在表徵系統關連起來，對於學生建構內在表徵則有其重要性，也因此我們將教學表徵又增加了「學生內在表徵的察覺」維度，搭配前一段所述的四的維度就成了本研究的五個教學表徵維度。","在多元表徵的議題上，許多學者都曾經建議教師在教學時應盡量多使用各種表徵系統，藉此增加學習的深度與廣度。如Janvier（1987a、1987b）的研究中指出多元表徵對於學生的概念理解，尤其是抽象概念上扮演了舉足輕重的角色；並且認為數學概念的建構不是一次兩次的教學就能夠完成的，必須依靠經驗逐漸地累積、完善，需藉由不同的表徵才能完成。Lesh、Post與Behr（1987）的研究中以有理數為主題，探討表徵的幾種角色、表徵之間的轉譯、以及在數學學習和解題歷程中的作用；他們將表徵分為實際事物、具體操作模型、圖像或表格、口語、書寫符號等五大類，每個數學概念都可以用不同類型的表徵來傳達。Goldin與Kaput（1996）曾提出了五種主要的表徵形式：口語／文字（基於語言）、形象化（基於五感）、符號（數學形式）、情感（自我概念）、計畫或實行操作；Goldin（1998）在後續的研究中探討了這些不同類型的表徵在數學學習與解題的發展與重要性，並認為表徵可以是符號、圖像、文字、或任何可以用來代表或呈現某些事物的東西。","對於學生而言，同一的數學概念可以有許多表徵，而不同的表徵與概念之間就會有「表現是否適切」的差別。在此基礎下，許多研究也進行不同表徵的教材與能力對於數學學習的影響，例如，Greeno（1987）在研究中發現，使用圖形表徵更能提升學習成效或思考表現，用於解題過程中幫助思考其所帶來的幫助常優於文字表徵。國內外還有許多與表徵相關的研究。Bright、Behr、Post與Wachsmuth（1988）調查了學生在數線上對於分數的表徵以及教學對這些表徵的影響，研究中對四年級和五年級的學生進行實驗，研究結果認為語言的陳述方式會影響學生在數線上標記分數的表徵，並提出數線具有視覺及符號兩種表徵方式的組合，以及分數的單位量與分母之間根據關係的不同，對於學生的困難度也有所不同。許瑋芷、陳明溥（2010）的研究則使用兩種不同表徵的教材（圖形與數字），探討國小學生在樣式推理上的差異，發現樣式推理學習過程中，圖形表徵類的教材可以促進樣式推理的思考表現。Brenner等人（1997）在跨國研究中對六年級的美國學生與亞洲（中國、日本和台灣）學生進行比較，結果顯示，中國學生在表徵任務的得分最高，除了分數的視覺表徵以外，所有亞洲學生的得分都明顯高於美國學生。這個結果或許能說明這些亞洲國家的學生在國際數學評比有更佳表現的可能原因。","對於老師來說，使用適切的數學表徵來教學，以及能否進行表徵之間的轉換就常常是教學是否成功的重要因素。Lesh等人（1987）的研究也提到表徵之間的轉譯對數學的學習、概念的建構是重要的。舉例來說，Brenner、Herman、Ho與Zimmer（1999）認為能夠運用多種表徵方式是數學思維和解決問題的關鍵，對於某個數學概念，如果能夠在各種表徵之間進行轉換，才能代表學生已經深入的了解此數學概念。Greeno（1987）也在教學上建議教師應該加強表徵之間的靈活運用，使得學生能在表徵之間的轉換過程中，增加學習的深度。這也說明本研究試圖瞭解教師對於表徵的選擇與使用有其價值。","凡是皆有利弊，因此也有學者提出過度使用或不當的表徵在教學上可能也會對學生造成負面的影響。何緼琪與林清山（1994）的研究探討表徵策略教學對國小低解題正確率學生的解題效果，發現低正確率的學生在比較類應用題的困難主要是在問題表徵階段，因此想要提升學生解題的能力，應該從幫助學生形成正確的表徵問題能力著手，一旦缺乏適當的引導，學生較難主動利用圖形表徵幫助解題。該研究也指出，一般情況下，使用圖形表徵幫助解題可以增進解題能力，但是對於低正確率的學生而言，使用圖形表徵幫助解題可能增加認知負荷，因學習時間較短會導致學習效果不如較高正確率的學生。林香（2003）的研究中探討國小數學資優生在解題時運用圖畫表徵之策略，並發現運用圖示策略但是解題錯誤的原因大部分是因為使用了錯誤的圖畫表徵，有的是指使用部分條件、遺漏訊息或者有錯誤想法，有的是圖形表徵比例不正確導致解題時的誤判，並將解題過程的差異分為四大類：圖畫表徵的內容差異、圖畫表徵的形成差異、圖畫表徵的運用差異、評估解答的差異。左台益與蔡志仁（2001）的研究探討高中生橢圓概念多重表徵之認知特性，並分析學生在表徵運用上的表現，發現由於學生對於各種表徵的認知若仍未熟悉，過多的表徵可能造成學習上的認知負荷，因此建議教師在教學時對於表徵的選擇與使用須慎重。","教師自身的數學表徵的具備、多樣性與轉化又是如何？針對職前教師的表徵研究目前並不多見，Zazkis與Liljedahl（2004）調查了小學職前教師如何理解質數的概念，並認為由於質數可以使用的表徵較為單一，導致一些職前教師對於質數的概念理解困難。本計畫主持人針對中學職前教師有關教學表徵選擇概念心像做了考察，發現在概念引入時，在沒有任何的提示或干擾下許多職前教師會將焦點放在生活實例或與生活相關的事物表徵中，但實際上卻經常使用課本的定義或例題作為概念引入表徵的選擇。","綜合這些論點，對於數學教師而言，選擇適合的數學表徵來協助學生內化數學內容對於學生的數學學習扮演關鍵角色，透過教師與教材所提供的數學外在表徵來與學生內在表徵系統關連起來，對於學生建構內在表徵則有其重要性。從某個角度來看，一個人對某個概念的概念心像與這個個體對這個概念的內在表徵有密切的關係。在宋玉如（2008）關於中學數學教師應有的數學教學特質研究中，研究者提供了幾個常見的數學表徵，包含：例子、圖畫、比喻、生活例子、實際數值、證明、定義、公式、故事、抽象符號等給中學生選擇，研究發現中學生認為理想教師在數學教學中應儘量以例子、圖畫、恰當比喻、生活物品表徵來傳遞數學概念；其次是使用數值實例、證明、定義；而最不符合學生心中理想教師的表徵使用是公式、故事與抽象符號來傳遞數學概念。這個結果顯示出中學生對於數學學習上認為老師應聚焦於「讓學生理解數學」、「避免僅用形式的、抽象的表徵」，有趣的是，教師們認為應多用於引發學生興趣的「故事」表徵，並非中學生認為理想的數學概念傳遞表徵，代表學生也並非只一昧追求花俏的包裝而不在乎數學內涵的表徵方式。這個研究不僅能帶給實際的數學教師許多省思，也提供我國實徵性研究資料，在台灣不同的表徵對於學生的確有不同的教學期望與感受。","整體而論，謝佳叡（2011）認為職前教師在表徵的使用考量上，並非聚焦於表徵出現的先後或使用情境，而是關注在學生對於表徵的接受度，以及表徵對於學生學習的感官刺激。若將實習教師展現的心像製成感官-邏輯（數學）光譜，並將實習教師的選擇呈現依感官-邏輯程度置於光譜上（如圖1），則電腦、故事、漫畫等表徵將置處於感官性一端，另一端則為定義、定理的邏輯性，其餘表徵則分列兩端之間（圖1僅表達各表徵的相對位置概念，非絕對比例）。其中，生活實例與圖形偏於感官性，但生活實例又更偏感官性。而表格與式子則屬於較抽象、偏邏輯性的表徵，相較之下，職前教師表現出式子又更接近邏輯性。而學生易接受、易起共鳴、易感興趣的表徵則偏感官性表徵，其中虛線代表越往邏輯性則這些特徵越趨減弱。","早在1960年代末期，教育學者Jackson（1968）就針對學生參與（Student Engagement）這個議題進行系統地研究的研究，並將學生參與和學生的課程經驗加以結合，在當時學生的課堂參與尚未成為一個專有的構念。到了1980年初期，關於學生參與的議題已漸漸獲得關注，但大多數相關研究能聚焦於學生參與課堂的時間佔比（Chapman, 2003），然而，當時仍然尚未研究將「學生參與（「student engagement」）」視為一個構念，當然也就沒有具共識性的界定，也未有學者提出好的測量的方式（Mosher \u0026 MacGowan, 1985）。一直到了1980年代的末期，學生參與這個構念才逐漸形成，在教育研究上也開始關注它的內涵與類型。在類型上，如Meece、Blumenfeld與Hoyle（1988）從學生目標導向的視角提出「認知參與」的概念；Connell（1990）則從學生動機的視角提出了學生情感參與的各個變項。Newmann（1992）則集兩方想法，並認為學生參與應包含學生的心理投入，認為學生的認知參與和情感參與是學生參與的實質內涵。","在這兩種參與之外的，NCTM在1991年公布的數學教學的專業標準中，將「促進課堂交流和培養數學集體意識方法」列為對數學教師知識的重要觀察面向（NCTM，1991）。Erickson與Shultz（1992）則從學生課程經驗角度提出的課程參與的構念，認為學生完成課程的經驗可以分成社會聯繫（social relational）與學科（subject matter）兩個面向，前者是指課堂中師生或生生之間的互動，而後者是學生與教材的互動，換言之，此時社會互動這一種外顯可被觀察的學生參與類型被分離出，至此學界對於學生參與的面向大至已具體成形，大抵來說，學生參與在研究上可以分成認知面向、情意面向與實際課堂的行為交流面向（謝佳叡，2014）。到了1990年以後，關於學生參與的研究大都涉及學生行為參與（behavioral engagement）、認知參與（cognitive engagement）、情感參與（emotional engagement）等不同面向，各研究者根據自己的研究角度將學生參與視為上述的三個面向中的元素進行研究（孔企平，2003）。關於三類的學生參與面向，部分相關的研究概述如下：","Kong、Wong和Lam（2003）將認知參與定義為學生在參與課程中採用的各種認知策略。無獨有偶的，Pintrich與Schrauben（1992）界定學生在課堂中的認知參與也包含了學習策略。而Meece、Blumenfeld與Hoyle （1988）則從學生目標導向的觀點，認為學生認知參與包含了學生的認知策略與自我監控。可以發現，學習策略的形成是這些學者主張的共通點，這也成了本研究可以捕捉認知參與的觀點，亦即學生是否在過程中形成或採用學習策略。在學習策略的界定上，Meece等（1988）認為認知參與和學生的思維有關，並依據學生參與的層次進一步分成積極參與（active engagement）和表面參與（superficial engagement）；Biggs（1987）則從學生認知參與的角度來看，將學習策略分成的淺層（表層）取向（the surface approach）與深層取向（the deep approach）。謝佳叡（2011）從學生課堂常使用的學習策略如記憶、回憶、觀察、聽課、思考、批判、對照、理解、分析、評價等，依認知目標的深度分為深層與淺層參與，例如，若老師的教學行動中有試圖讓學生進行思考、批判、對照、理解、分析、評價等高層次的參與活動，則視為教師試圖讓學生進行深層參與；若讓學生進行記憶、回憶、觀察、聽課等則視為淺層參與。這些關於學生參與的分法對於本研究的資料分析上有極大的幫助。","不同研究者對於情感參與的界定也都不同，但大抵而言，在情感參與的研究上多與學生動機有關。Connell（1990）認為學生的情感參與是指學生在課堂情境中參與學習活動的程度與情感品質，其中包含六個變因：孤僻（不愛交際）、投入參與、遵守規範、順從、革新、反叛。Skinner與Belmont （1993）認為學生的情感參與包含了課程中興趣、快樂、憂慮和憤怒的四種情感上的體驗； Kong、Wong和Lam（2003）將這些學者提出的要素分成積極情感、消極情感與遵守規範三類。李靜儀與龔心怡（2019）則將數學情感參與分為興趣因素、成就取向、歸屬感三個次構面，興趣因素是指學生在數學學習上表現出興趣，能被數學問題吸引，以及對解決數學問題感到好奇；成就取向則會投入較多努力以期得到好成果並帶來滿足感；歸屬感則是認同數學課程，覺得自己在數學課室中是很重要的成員。由上述可知，情感參與與學生情意面向有十分密切的關連，尤其在情感與動機因素上。","行為參與是一種基本的參與形式，也是一種外顯且易觀察的參與形式。Nystrand（1991）將學生參與分成程序性參與（procedural engagement）與實質性參與（substantive engagement），前者就是指行為參與，而後者包含了學生認知上的投入，並提出只有當學生有實質性參與才與高層次的思維有關，言下之意，行為參與與學生高層次的思維是有鴻溝的。許多研究將行為參與視為一種課堂參與的型式，包含了學生在課程中可以被實際觀察的外顯行為，然而有些學者則認為行為參與除了課程中，也應包含課後的學習行為（孔企平，2003）。本研究關於行為參與主要參考Miserandino（1996）提出的論點，該學者認為行為參與必須是學生在課堂可以被觀察的行為，並提出的行為參與的六個要素：參與、堅持、逃避、茫然無助、參加討論和專注力。而Patrick、Skinner與Connell（1993）在探討行為參與中關於教師處理手法時，以該手法對於學生行為參與是否有積極的介入與作為作為判別準則，這些研究給本研究提供好的參考。從這個分類也可以看出，行為參與與情感參與、認知參與並非完全分隔，但從仍可看出三者的獨特性。而本研究參考上述所提出的論點，關於學生參與同樣會從行為、情感、認知參與切入，但在行為參與上本研究則傾向界定於在課堂上可觀察的或可測的（如仿照、例題練習、討論、上台解題等）活動參與，而認知參與則必須涉及到學生學習策略的提供，其中，此策略需涉及協助或要求學生進行回憶、觀察、思考、對照、體驗、理解數學等與教材內容產生聯繫的活動。","公元2000年後，關於學生參與議題的研究進入一個新的風貌，許多關於學生參與的理論與測量方法在新世紀後紛紛被提出（如李靜儀、龔心怡，2019；Appleton, Christenson, \u0026 Furlong, 2008; Carter, Reschly, Lovelace, Appleton, \u0026 Thompson, 2012; Glanville \u0026 Wildhagen, 2007; Ketonen, Haarala-Muhonen, Hirsto, Hänninen, Wähälä, \u0026 Lonka, 2016; Smith, Sheppard, Johnson, \u0026 Johnson, 2005; Taylor \u0026 Parsons, 2011）。Christenson, Reschly, \u0026 Wylie（2012）也出版了「學生參與研究手冊」，將最新關於學生參與的研究做一個整理與回顧，可見此議題所受的關注程度。其中學業參與（academic engagement）的議題特別被關注。Appleton、Christenson與Furlong（2008）就提到有關學業參與的研究這20年來累積十分迅速。李靜儀與龔心怡（2019）的研究中就指出在西方此議題在教育界受到極大關注，且遍及各個不同階段，從小學到大學階段都有，反觀國內的研究卻不多，且大多以大學生或是高中生為研究對象，國中階段學生之學業參與的研究則不多見，國小階段就更少了。Martin、Way、Bobis與Anderson（2014）的研究就提出，7、8年級學生的學業參與顯著低於6年級的學生，這個研究也表明了探究不同階段學生的學業參與有其意義。而在補救教學上，這方面的研究就更少見了，顯見這方面的研究議題實有探討的必要。","本研究所謂「教學表徵」鎖定在數學教學過程上，意指教師在補救教學之實踐過程上有關「數學表徵理解與運用的相關教學知能」，依據前一節有關教學表徵的論述，本研究將教學表徵細分成五個子構面，分別是數學表徵理解與運用、多元數學表徵認知、數學表徵選擇與表達、表徵轉化與教材設計、學生內在表徵的察覺（noticing）等。（理論基礎可參閱本節1.1）","本研究假定在不同的教學階段不同表徵的意義與使用方式，會隨著實踐的過程有不同。本研究有關補救教學實踐過程的分類理論基礎是建立於謝豐瑞（2012）所提出對於理想教師行為指標模型，以及謝佳叡（2011）提出有關數學教學表徵選擇之概念心像架構。謝豐瑞（2012）從實徵研究中對理想教師的看法，分離出二十二個中學數學教學專業知能指標項目，包含十七個教師的數學教學知能指標項目。本研究主要探討數學補救教學實踐時，教學表徵與學生參與，因此無法也無意一一全部採用這十七的指標，而是依據研究相關的興趣與搭配教學流程，參考這十七個指標選取其中六個教學表徵與學生參與相關的六個項目，分別是「能營造良好的數學學習環境，提升學生的參與度（場域營造）」、「能善用各種方式以引發學生的學習動機（引發動機）」、「能使用恰當的表徵方式呈現數學概念，促使學生形成概念（表徵引入）」、「能恰當安排數學教學材料以幫助學生理解數學內容（內容理解）」、「安排恰當的學生演練活動（演練活動）」、「用恰當的評量方式以掌握學生的數學學習情形（學習評量）」。特別說明的是，本研究焦點鎖定在中、小學補救教學，其中中學部分可直接使用本結構。由於謝豐瑞（2012）提出的結構原始設計是探索數學理想教師教師的知能結構，儘管調查是以中學生為主，但教師教學知能的項目在理論建立時並未排除小學教師，且本研究僅取用該研究者的知能結構，並未採用其調查結果於小學教師上。","在數學表徵的類型上，本研究則採用宋玉如（2008）分類，聚焦的數學表徵包含：實體教具、桌遊、例子、圖畫、比喻、生活例子、實際數值、證明、定義、公式、故事、抽象符號等，形成數學表徵型態與補救教學表徵觀察的結構表（如表一），在教學表徵的實際觀察探究上會依據這樣的觀察項目來作為資料收集與判斷的方式。","本研究有關學生參與主要以學生之認知參與、情感參與、行為參與等三個類型為基礎（Christenson, Reschly, \u0026 Wylie, 2012）。探討關於學生在課堂中，對於教學歷程之活動參與、投入、關注程度之概括性認識。例如：學生在課堂上運用學習策略、學生投入課堂的動機與情緒、學生參與課堂活動的專注與投入程度、師生在課堂上發言、主導比重上之平衡、…。在作法上也將搭配謝豐瑞（2012）的中學數學教學專業知能指標選出的六個項目，與三種學生參與模式搭配。","本研究主要在探討在不同的補救教學實踐過程中，教學表徵運用與學生參與之間的關聯，以及對於補救教學成效的影響評估，故「教學表徵」與「學生參與」為本研究之主軸，其中「教學表徵」包括數學表徵理解與運用、多元數學表徵認知、數學表徵選擇與表達、表徵轉化與教材設計、學生內在表徵的察覺五個部分：而「學生參與」則包含情感、認知、行為(社會)參與三個部分。研究架構可分成兩個層次，第一個層次是將「教學表徵」與「學生參與」兩者的關係作為探討主軸，第二個層次則建立在第一個層次上，探討這樣的關聯對於補救教學成效影響為何？研究架構最底層則是不同的補救教學實踐過程，不用箭頭代表本研究將這兩層建立在這個教學實踐過程，並非探討其之間的關係。研究架構請參見圖2。","Allardice, B. S. (1977). The development of written representations for some mathematical concepts. Journal ofChildren\u0027s Mathematical Behavior, 1(4), 135-148.","Appleton, J. J., Christenson, S. L. , \u0026 Furlong, M. J. (2008). Student engagement with school: Critical conceptual and methodological issues of the construct. Psychology in the Schools, 45(5), 369-386.","Biggs, J. B. (1987). Student approaches to learning and studying. Hawthorn, Australia: Australian Council for Educational Research (ACER).","Booth, J. L., \u0026 Siegler, R. S. (2006). Developmental and individual differences in pure numerical estimation. Developmental Psychology, 42(1), 189-201.","Brenner, M. E., Herman, S., Ho, H. Z. \u0026 Zimmer, J. M. (1999). Cross-national comparison of representational competence. Journal for Research in Mathematics Education, 30(5), 541-547","Brenner, M. E., Mayer, R. E., Moseley, B., Brar, T., Duran, R., Reed, B. S., \u0026 Webb, D. (1997). Learning by understanding: The role of multiple representations in learning algebra. American Educational Research Journal, 34(4), 663-689.","Brenner, M. E., Herman, S., Ho, H. Z. \u0026 Zimmer, J. M. (1999). Cross-national comparison of representational competence. Journal for Research in Mathematics Education, 30(5), 541-547","Bright, G. W., Behr, M. J., Post, T. R., \u0026 Wachsmuth, I. (1988). Identifying fractions on number lines. Journal for Research in Mathematics Education,19, 215-232.","Carter, C. P., Reschly, A. L., Lovelace, M. D., Appleton, J. J., \u0026 Thompson, D. (2012). Measuring student engagement among elementary students: Pilot of the student engagement instrument--Elementary version. School Psychology Quarterly, 27(2), 61–73.","Chapman, E. (2003). Alternative approaches to assessing student engagement rates. Practical Assessment, Research \u0026 Evaluation, 8(13). Retrieved from http://PAREonline.net/getvn.asp?v\u003d8\u0026n\u003d13","Chen, M. P., Lee, C. Y., \u0026 Shu, W. C. (2015). Influence of mathematical representation and mathematics self-efficacy on the learning effectiveness of fifth graders in pattern reasoning. International Journal of Learning, Teaching and Educational Research, 13(1), pp. 1-16.","Christenson, S. L., Reschly, A. L., \u0026 Wylie, C. (Eds.) (2012). Handbook of research on student engagement. New York, NY: Springer.","Connell, J. P. (1990). Context, self, and action: A motivational analysis of self-system processes across the life-span. In D. Cicchetti (Ed.), The self in transition: Infancy to childhood (pp. 61-97). Chicago, IL: University of Chicago Press.","English, L. D. \u0026 Halford, G. S. (1995). Mathematics education: Models and processes. Mahwah, NJ: Lawrence Erlbaum Associates.","Erickson, F., \u0026 Shultz, J. (1992). Students’ experience of the curriculum. In P. W. Jackson (Ed.), Handbook of research on curriculum: A project of the American educational research association. New York, NY: Macmillan.","Fauzan, A., Musdi, E., \u0026 Yani, R. P. (2017).The influence of realistic mathematics education (RME) approach on students’ mathematical representation ability. Advances in Social Science, Education and Humanities Research,173, 9-12.","Glanville, J. L., \u0026 Wildhagen, T. (2007). The measurement of school engagement: Assessing dimensionality and measurement invariance across race and ethnicity. Educational and Psychological Measurement, 67(6), 1019-1041.","Goldin, G. A. (1998). Representational systems, learning, and problem solving in mathematics. Journal of Mathematical Behavior, 17(2), 137-165.","Goldin, G. A., \u0026 Kaput, J. J. (1996). A joint perspective on the idea of representation in learning and doing mathematics. In L. P. Steffe, P. Nesher, P. Cobb, G. A. Goldin, \u0026 B. Greer (Eds.), Theories of mathematical learning (pp. 397-430). Mahwah, NJ: Erlbaum.","Goldin, G., \u0026 Shteingold, N. (2001). Systems of representations and the development of mathematical concepts. In A. A. Cuoco \u0026 F. R. Curcio (Eds.), The roles of representation in school mathematics: 2001 yearbook (pp. 1-23).","Greeno, J. G. (1987). Instructional representations based on research about understanding. In A.H. Schoenfeld (Ed.), Cognitive Science and Mathematics Education (pp. 61-88). Hillsdale,NJ: Erlbaum.","Hiebert, J., \u0026 Carpenter, T. (1992). Learning and teaching with understanding, In D. Grouws (Ed.), Handbook of research on mathematics teaching and learning. Macmillan Publishing Company.","Jackson, P. W. (1968). Life in classroom. New York, NY: Holt, Rinehart \u0026 Winston.","Janvier, C. (1987a), Representation and understanding: The notion of function as an example, In C. Janvier (Ed.), Problems of representation in the teaching and learning of mathematics, (pp. 67–72), Hillsdale, NJ: Lawrence Erlbaum Associates.","Janvier, C. (1987b). Translation processes in mathematics education. In C. Janvier (Ed.) Problems of representation in the teaching and learning of mathematics, (pp. 27-31). Hillsdale, NJ: Lawrence Erlbaum.","Kaput, J. (1991) Notionas and representations as mediators of constructive proceses. In E. von Glasersfeld (Ed.), Radical constructivism in mathematics education, 53-74. Netherlands: Kluwer Academic Publishers.","Ketonen, E. E., Haarala-Muhonen, A., Hirsto, L., Hänninen, J. J., Wähälä, K., \u0026 Lonka, K. (2016). Am I in the right place? Academic engagement and study success during the first years at university. Learning and Individual Differences, 51, 141-148.","Kong, Q. P., Wong, N. Y., \u0026 Lam, C. C. (2003). Student engagement in mathematics: Development of instrument and validation of construct. Mathematics Education Research Journal, 15(1), 4-21.","Lesh, R., Post, T., \u0026 Behr, M. (1987). Representations and translations among representations in mathematics learning and problem solving. In C. Janvier, (Ed.), Problems of Representations in the Teaching and Learning of Mathematics (pp. 33-40). Hillsdale, NJ: Lawrence Erlbaum.","Martin, A. J., Way, J., Bobis, J., \u0026 Anderson, J. (2015). Exploring the ups and downs of mathematics engagement in the middle years of school. The Journal of Early Adolescence, 35(2), 199-244.","Minarni, A., Napitupulu, E.E., \u0026 Husein, R. (2016). Mathematical understanding and representation ability of public junior high school in north Sumatra. Journal on Mathematics Education, 7 (1), 43-56.","Mason, H. J. (1987). What do Symbols Represent? In C. Janvier (Ed.), Problems of representation in the teaching and learning of mathematics (pp. 73-81). Hillsdale, NJ: Lawrence Erlbaum.","Meece, J. L., Blumenfeld P. C., \u0026 Hoyle, R. H. (1988). Students’ goal orientations and cognitive engagement. Journal of Educational Psychology, 80(4), 514-523.","Miserandino, M. (1996). Children who do well in school: Individual differences in perceived competence and autonomy in above-average children. Journal of Educational Psychology, 88(2), 203-214.","Mosher, R., \u0026 MacGowan, B. (1985). Assessing student engagement in secondary schools: Alternative conceptions, strategies of assessing, and instruments. Madison, WI: University of Wisconsin, Research and Development Center. (ERIC Document Reproduction Service No. ED 272 812)","NCTM (National Council of Teachers of Mathematics) (1991). Professional standards for teaching mathematics. Reston, VA: Author.","NCTM (National Council of Teachers of Mathematics) (2000). Principles and standards for school mathematics. Reston, VA: Author.","Newmann, F. M. (1992). Student engagement and achievement in American secondary schools. New York, NY: Teachers College Press.","Niss, M., \u0026 Højgaard, T. (Eds.). (2011). Competencies and mathematical learning. Ideas and inspiration for the development of mathematics teaching and learning in Denmark (Tekster fra IMFUFA, no 485). Roskilde: Roskilde University, IMFUFA.","Nystrand, M. (1991). Student engagement: When recitation becomes conversation. In H. C. Waxman (Ed.) Effective teaching: Current research, (pp. 257-276) Berleley: McCutchan publishing corporation..","Patrick, B. C., Skinner, E. A., \u0026 Connell, J. P. (1993). What motivates children’s behavior and emotion? Joint effects of perceived control and autonomy in the academic domain. Journal of Personality and Social Psychology, 65(4), 781-791.","Pintrich, P. R., \u0026 Schrauben, B. (1992). Student motivational beliefs and their cognitive engagement in academic classroom tasks. In D. H. Schunk \u0026 J. L. Meece (Eds.), Student perceptions in the classroom (pp. 149-175). Mahwah, NJ: Lawrence Erlbaum Associates.","Resnick, L., \u0026 Ford, W. (1981). The psychology of mathematics for Instruction. Hillsdale, NJ: Lawrence Erlbaum Associates.","Skinner, E. A. \u0026 Belmont, M. J. (1993). Motivation in classroom: Reciprocal effects of teacher behavior and student engagement across the school year. Journal of Educational Psychology, 85(4), 571-581.","Smith, K. A., Sheppard, S. D., Johnson, D. W., \u0026 Johnson, R. T. (2005). Pedagogies of engagement: Classroom-based practices. Journal of Engineering Education, 94(1), 1-15.","Supandi, S., Waluya, B., Rochmad, R., Suyitno, H., \u0026 Dewi, K. (2018). Think-Talk-Write model for improving students\u0027 abilities in mathematical representation. International Journal of Instruction, 11(3), 77-90. https://doi.org/10.12973/iji.2018.1136a","Tandililing, E. (2015). Effectivity of problem based learning (PBL) in improving students\u0027 mathematical representation. Proceeding of International Conference On Research, Implementation And Education Of Mathematics And Sciences 2015, 17-19.","Zazkis, R., \u0026 Liljedahl, P. (2004). Understanding Primes: The role of representation. Journal for Research in Mathematics Education, 35(3), 164-186.","左台益、梁勇能（2001）。國二學生空間能力與van Hiele幾何思考層次相關性研究。師大學報：科學教育類，46（1、2），1-19。","何緼琪、林清山（1994）:表徵策略教學對提升國小低解題正確率學生解題表現之之研究。教育心理學報，27，259-279。","呂虹霖、許秀敏（2012）。補救教學的理念與實務。載於張素貞、李俊湖（主編），十二年國民基本教育 精進教學的理念與實踐（181-202頁）。臺北：國立臺灣師範大學。","宋玉如（2008）。中學數學教師應有的數學教學特質研究──學生觀點。國立台灣師範大學數學研究所教學碩士論文（未出版）。","李靜儀、龔心怡（2019）。國中學生數學學業投入量表之發展與編製及其信、效度研究。測驗學刊（in press）。","林香（2003）。國小數學資優生的解題策略探究－以圖畫表徵策略為例。國立臺北師範學院數理教育研究所碩士論文，未出版，臺北市。","張鈿富、林松柏、周文菁（2012）。臺灣高中學生學習投入影響因素之研究。教育資料集刊，54，23-58。","許瑋芷、陳明溥（2010）。數學表徵及數學自我效能對國小學生樣式推理學習成效之影響。數位學習科技期刊，2(3)，42-60。","游自達（1995）。數學學習與理解知內涵—從心理學觀點分析。國立臺中師範學院初等教育研究所初等教育研究集刊，3，31-45。","謝佳叡（2011）。中學數學實習教師之數學教學概念心像探究，國立台灣師範大學數學系博士班論文，未出版。","謝佳叡（2014）。中學數學實習教師關於學生參與之概念心像探究。臺灣數學教育期刊，1（2），25-38頁。","在教學表徵選擇，許多研究已經指出表徵對數學學習與解題佔有重要的角色（Goldin \u0026 Kaput, 1996; Kaput, 1991）。關於教學表徵方面，Bruner在發現學習論中，將人類對於其環境中的事物經知覺而將外在物體或事件轉換為內在事件的過程稱為認知表徵（cognitive representation）或知識表徵（representation of knowledge），意指人類是經由認知表徵獲得知識（張春興，1996）。依據Bruner的研究，這樣的認知表徵有三種：動作表徵、圖像表徵、符號表徵（張春興，1996；Resnick \u0026 Ford, 1981）。表徵（representation）並非概念本身，而是對於一個被表徵概念的再次呈現（re-present），而這個表徵動作可分為內在表徵（signified; internal）與外在表徵（signifier; external）（Goldin \u0026 Kaput, 1996; Hiebert \u0026 Carpenter, 1992）。綜合這些論點，對於數學教師而言，選擇適合的數學表徵來協助學生內化數學內容對於學生的數學學習扮演關鍵角色，透過教師與教材所提供的數學外在表徵來與學生內在表徵系統關連起來，對於學生建構內在表徵則有其重要性。從某個角度來看，一個人對某個概念的概念心像與這個個體對這個概念的內在表徵有密切的關係。","在宋玉如（2008）關於中學數學教師應有的數學教學特質研究中，研究者提供了幾個常見的數學表徵，包含：例子、圖畫、比喻、生活例子、實際數值、證明、定義、公式、故事、抽象符號等給中學生選擇，研究發現中學生認為理想教師在數學教學中應儘量以例子、圖畫、恰當比喻、生活物品表徵來傳遞數學概念；其次是使用數值實例、證明、定義；而最不符合學生心中理想教師的表徵使用是公式、故事與抽象符號來傳遞數學概念。這個結果顯示出中學生對於數學學習上認為老師應聚焦於「讓學生理解數學」、「避免僅用形式的、抽象的表徵」，有趣的是，教師們認為應多用於引發學生興趣的「故事」表徵，並非中學生認為理想的數學概念傳遞表徵，代表學生也並非只一昧追求花俏的包裝而不在乎數學內涵的表徵方式。同一個研究，宋玉如（2008）也發現關於媒體的選用與呈現，中學生認為理想的教師應要適當地使用教具（如，圖卡、模型、生活物品）教學，其次是電腦輔助教學，而只使用粉筆黑板的教師則最不受學生青睞。這個研究不僅能帶給實際的數學教師許多省思，也提供我國實徵性研究資料，在台灣不同的表徵對於學生的確有不同的教學期望與感受，此也提供本研究對於數學表徵選擇的分析洞察。","表徵不止對於學生的數學學習有直接的關係，對於教師的數學教學，例如在課堂上精確地使用表徵、選擇並提供學生適合的數學表徵也都是現代的教師知識測量研究十分著重的偵測點（Hill et al., 2007），如SII/LMT的檢定項目就涵蓋教師如何選擇例子與表徵。","本研究發現，實習教師自發性地展現出表徵選擇面向的心像僅約佔全體樣本的21.0%，而這約五分之一的E-FT中，卻有多達85%（11/13）的將焦點放在生活實例或與生活相關的事物表徵中，顯見在沒有任何的提示或干擾下，實習教師仍會主動喚起與生活結合的表徵。FT30就提出：「絕不（或者99.99％）以直接闡述定理或證明定理為教導高中數學的方式，舉例（大量的例子，能與生活結合更好）…才是教學該注意的重心。」","在學生參與面向時，我們提到FT38提到：「由生活方面的實體說明，真的能讓學生有高度專注力」，可見實習教師生活實例使用的考量之一是讓學生能專注於課堂上。而另一個讓實習教師使用生活例子或生活問題作為教學表徵選擇的依據考量，是提起學生興趣，例如，FT48所說：「以生活中之問題提起學生的學習興趣。」；FT3也說：「把一些生活中可能會發生的問題和教學做結合，讓學生有興趣去學習數學」。這個觀點我們也同樣可以從學生情意面向的動機成分中已稍加論述，除了貼近學生生活的事物容易消除隔閡（例如FT31所說：「教學時可多用生活化語言引入，讓學生學習較為平順。」），就生活連結的本質看，實際生活問題的實用特徵會讓學生感覺數學並非定義、定理，也不只是抽象的符號，而是實實在在存在於我們的生活周圍。","另外，有些實習教師會強調使用生活相關例子，卻是另一個完全不同的考量。他們認為由於生活中幾乎看不到數學的蹤影，也因此教師必須在數學教學中多使用其他輔助方式。例如，FT1所說：「學生都會覺得數學在生活中很少用到，甚至不會用到，所以數學教學方面盡量吸引學生興致」；FT25也認為：「數學教學最大的困難點在日常生活幾乎不見它的蹤影，尤其用符號操作這件事。」我們可以進一步分析這兩位教師的想法。首先，他們心裡認為數學知識學習有超越日常生活以外更高層次的需求與目的，因此，就算生活幾乎用不到（例如符號操作），學生仍須學習數學。其次，學生對於日常生活中常見的事物接受度較高，因此生活中常用到的也將使得數學教學更為容易。其三，數學並非沒有生活面，僅是以十分隱晦的方式存在於生活當中，學生較無法觀察到，教學必須克服這個困難，以彌補生活中不常見所造成的教學困難。其中，如FT31所說：「教學時可多用生活化語言引入，讓學生學習較為平順。」或是像FT59所提及數學教學要「生活化：不單單是死板的教學，能和生活做聯結。」這些都是透過對學生提供數學的生活實例表徵的方式來彌補數學不夠生活化的缺失。","另一個被實習教師主動提及的教學表徵是「定義」，認為定義是數學概念的基礎，因此，教學學上必須加以強調，例如FT8就提到：「不管忘多少，定義一定不能忘。Ex：就算拋物線內容全忘了，焦準定義一定要記得！」而且定義的給予也必須嚴謹，此部分在數學傳遞面向已有提及。整體而論，實習教師並沒有指出定義表徵如何的使用於數學教學上，且提及的比例僅約15.4%，但數學定義相較於其他表徵的選擇，仍算是一種被關注的表徵。","新概念引入是實習教師容易展現教學表徵選擇面向的情境維度。在[1A]、[1B]沒有教學單元的情形下，有56.5%的實習教師（共計35人）展現出選擇合適表徵以傳達數學概念的心像，其中又以生活實例最受實習教師在概念引入之初的喜愛，在35位中有17位實習教師提及，其次則是故事表徵，也有7位會考慮使用；其他如數學例子、圖形、定義、符號等表徵也僅零星出現，有此反映出，在沒有教學單元時的思考下，實習教師表達數學的表徵方式仍傾向與生活連結。若加入教學單元，則表徵選擇的情況並未展現，此情形可能受到概念典型表徵影響，亦即選擇數學概念本身最樸質之表徵作為教學的表徵使用，以致教師心中不會有喚起其他表徵選擇的思考，例如配方法教學的典型表徵是符號表徵，教師很少選擇其他適合表徵。在第伍章中，我們將對此有更深入的討論。","若比較國、高中實習教師的改變率並試著解釋其背後所象徵的意義，式子表徵無論在國、高中階段都具有低改變率（即高維持度），加上式子表徵的高使用選擇比例，可推得式子表徵是中學教師最為核心的函數教學表徵。而高中教師對於文字表徵與集合表徵的改變率明顯低於國中，表示從時間壓力的角度看，高中教師更堅持在於課堂中提供這兩種表徵，可能的一個原因在於文字表徵（定義）與集合表徵對於高中課程的使用需求與關連性都高於國中課程，也可能因為這兩類的形式化表徵對於國中生來說難度較高。相對的，國中實習教師對於函數機器表徵具有更穩定維持程度，可能在於國中教師認為函數機器屬於較為具體的比喻性表徵，即使在時間的壓力下也應使用以協助國中生瞭解函數。","而在概念引入的表徵選擇上，在時間足夠與不足的情況下教師對於教學表徵選擇確實會受到特殊情況的影響，但仍有一些表徵不會受到時間因素的影響。若比較國、高中實習教師因時間因素表徵選擇的改變率，研究得到式子表徵是國、高中實習教師最為核心的函數教學表徵；而高中教師對於文字表徵與集合表徵則比國中教師有更高的維持率，可能的一個原因在於文字表徵與集合表徵對於高中課程的使用需求與關連性都高於國中課程。相對的，國中實習教師對於函數機器表徵具有更穩定維持程度，可能在於國中教師認為函數機器屬於較為具體的比喻性表徵，即使在時間的壓力下也應使用以協助國中生瞭解函數。","總結新概念引入教學之表徵選擇，教師對於教學表徵選擇確實會受到特殊情況的影響，但由於這些不順遂的情境因素，我們正可看出實習教師心中的核心心像。某種程度也揭露實習教師的表徵選擇不但會受到數學單元的影響（如配方法單元與函數單元的單一與多元），也會受到學生認知程度所影響（對於不同階段展現不同的表徵選擇）。","在單元活動的設計上，我們除了探求一般教學情境，也同時探求實習教師對特殊教學方法的考量。在題[6C]中，我們提供一段敘述：「有一種教學方式是：老師先不講解，而是先拋問讓學生思考。」之後請實習教師回答所提供的哪些等差級數的活動他們覺得適用此方法教學。","表4-18是分析實習教師適合於演示前先讓學生思考之活動統計表。本研究以「0-30-60-100 （%）」作為「低-中-高度適合學生思考活動」的劃分線，研究發現對整體樣本教師而言，「日常生活實例」、「紙板操作活動」與「簡易數值實例」三者屬於高適合思考活動，「含有一般項」與「符號公式」則為低適合思考活動，由此觀之，中學實習教師傾向簡單、具體、學生可操作的活動讓學生思考，反之較為困難、抽象、形式的活動則傾向認為不合適。","若分別檢視國、高中實習教師，會發現對於國中實習教師來說，困難、抽象、形式的活動傾向不適合先讓學生思考之現象更為明顯，其中「含有一般項的實例求和」與「符號公式」仍為「低適合思考活動」，兩者都僅有14%的國中教師認為適合先給學生思考，而「公差為負求級數和」更從全體中學教師的「中適合思考活動」降為國中的「低適合思考活動」，表示國中實習教師認為公差為負的數值實例難度高，不適合在演示前先給學生思考。而「舉日常生活實例認識等差級數」在國中也降為「中適合思考活動」，若分析他們所描述的依據，可推得對於國中實習教師而言，他們認為在新概念剛教學之初，國中生尚未熟悉等差級數時要他們思考並舉生活實例有一定的困難。相對來說，高中實習教師除了「符號公式」之外，其餘皆為中等以上程度的適合學生思考，換言之，對許多高中教師來說，「含有一般項的實例」嘗試讓學生思考是合適的。","本題雖然並無指定教學的對象層級，然而「等差級數」單元屬於國中階段的內容對於中學實習教師來說理應不會有太大爭議，因而對於國、高中實習教師而言不應有太大差異。然而，研究比較國、高中階段的實習教師，發現對於適合學生思考的活動數高中實習教師平均比國中將近多了一個，已達統計上的顯著差異，其中「含有一般項的實例求和」與「公差為負求級數和」兩項的比例高中實習教師明顯多餘國中教師，且皆達顯著差異，合理推斷這些高中的實習教師將於高中實習接觸學生的經驗投射在本題當中，進而影響實習教師思考，換言之，在本題中學生知能面向之心像已被喚出。","進一步檢視實習教師選擇適合學生思考的依據理由，若整體分析原因，則較多實習教師所依據的理由為與被提到的次數如表4-19。其中，最多實習教師展現的選擇因子是屬於學生知能面向的「簡單、學生可以想出來」，共有22位實習教師展現，這些教師又以勾選紙板操作（17人）、簡易數值實例（17人）為並列最多，高斯故事（15人）次之。值得注意的是，在前一分節時我們將前四個活動（也就是第一群組）視為概念引動活動用來檢測學生情意、學生參與與教學表徵面向的心像，而在本題中適合思考的選擇因子最高的「簡單、學生可以想出來」屬於學生知能面向，而他們卻也大都勾選在這四項。本研究對於這個現象的一個解釋是：當實習教師在考量等差級數的活動設計時，安排高斯故事、生活連結、紙板操作等活動時所主要考量的並非從學生知能面向切入（亦即從教材難度適合學生認知或掌握學生瞭解程度等），一旦將教學活動轉為適合學生思考時，教師切入的面向就會改變，學生知能的概念心像就被學生思考面向所引動而突顯出來。","第二多人展現的適合思考的選擇因子是「具體、可實際動手操作」，這個因子牽涉到的面向則傾向教學表徵選擇與教學方法面向的心像，而以此作為選擇因子的13位實習教師全數都有勾選紙板操作，由此可知，紙板操作不但對學生來說是簡單、容易想出來的之外，也具有具體可動手實際操作的功能。而「與生活連結」則是另一個也是許多人視為適合學生思考的選擇因子，而這些人也大多勾選生活實例認識等差級數（11人），所牽涉到的概念心像也傾向教學表徵選擇心像。","在其次的選擇因子如圖形、故事則具有學生情意與教學表徵的面向，整體來說，實習教師對於學生思考的心像會與學生認知、教學表徵、教學方法與學生情意有不同程度的連結。","註* ：活動選擇次數係指展現選擇因子的實習教師中，有勾選該活動的人數（%），表中僅列出展現該因子的實習教師超過一半有勾選者之活動。","在54位透過選擇其他表徵進行教學的實習教師中，有49位改用數值實例進行對照再推導一次，1位改用與圖形結合，另4位實習教師則堅持維持代數符號表徵再推導一次或改為較簡易的係數，整體來說，選用實際的數字推導是實習教師首先喚起的表徵。在舉實例的這些實習教師其教學概念與用意也並不相同，這些方式又可大致可分成兩種不同的類型。第一類的實習教師透過實例來與代數符號的公式推導進行對照，期望透過對於數值具像來建立符號表徵推導過程的合理性與可接受性。這種方式的心理認知與其說是具體化教材讓學生容易吸收，倒不如視為試圖建立學生面對符號的信心與信念，認為「公式解只是數字的衍生」、「數字都會了符號也可以會」等。對這一類的方式來說，再一次使用數值實例做一次並沒有提供更多認知上的協助（因為數值實例就是配方法，而這個議題在之前早已經熟悉），而就對照的觀點來看，形式與數值實例給予學生的差異並不一定相稱，最大的差別除了數字以形式化符號取代以外，代數符號的一個重要的功能在於他能保留結構的型式與計算痕跡，而數值實例","第二類使用實例的教師則有著完全不同的思考，他們不是透過數值與符號的交叉對照，而是舉數個實例（或者讓學生多題演練），讓學生從多個例子的操作中，結構化「公式解（或配方法）」之運算過程，待學生熟悉後再進入「一般化的符號操作」（如FT6；FT24；FT26；FT34；FT35；FT40；FT41），這種將「對過程的抽象化」使得這個方式不同於前一類對於數學物件的抽象化的教師，換言之，這兩類的實習教師背後是兩種不同的數學教學知識在支撐，所展現的教學手法也不同。","另外有4位實習教師能選擇用代數符號推導一次，其中一個完全不改係數（FT13）重新再推一次，另外三個（FT5；FT55；FT60）則簡化係數（拿掉項係數，並兩倍x項係數）再推導一次，這種減少未知數個數的難度是否會跨過學生的認知的界線尚不得而知，但教師的策略心像卻十分清楚。"]